import os


config = {
    "admin_password": os.getenv("ADMIN_PASSWORD"),
    "email": "hospitalemergencycall@gmail.com",
    "password": "ASdf1234444",
    "app_password": "orpaimfumpbyeqcb",
    "jobs": ['מנהל/ת רכש', 'עובד/ת סוציאלי/ת', "טכ' חוץ", 'מנהל הרפואי של בית החלוים ', 'אח/ות', 'רופא/ה', 'פקיד/ה', 'רוקחת קלינית', 'סגן המנהל הרפואי ', 'מנהל הסיעוד', 'אם בית', 'פקיד/ה קורונה חול', 'יחסי  ציבור', 'טכנאי/ת ראשית מכון בריאות האישה ', 'כביסה', 'טכנאי/ת', 'פיזיקאי ראשי ', 'מנהל/ת מחלקה ', 'מנהח``ש', 'ארכיון', 'חשבונות', 'נהג/שליח', 'הנדסאית האחזקה ', 'פסיכולוגית', 'זימון', 'סגן מנהל', 'מפ``ס -מכזת תחום בריאות הסביבה', 'עוזר/ת מחקר', 'רופא מתמחה', 'תורן חוץ', 'מתאמת מניעת זיהומים-אח/ות', 'רשימת רפואית ', 'רופא בית ', 'רוקח', 'טכנאי PET CT', 'מנהל כספים', 'פזיותרפיסת/ית', 'טכנאי/ת מעבדה', 'מחסנאי', 'מטבח', 'מרכזת מניעת זיהומים-אח/ות', 'מנהל מחלקת מחשוב ', 'שיווק', 'עזר/ת טבח', 'עובד/ת נקיון', 'גנאן', 'מזכירה', 'מנהל משאבי אנוש', 'גביה', 'דייטנית', 'רופא מומחה', 'חשמלאי', 'אספקה סטרילית', 'מיילדת', 'עוזר/ת  מנכ``ל', 'טכנאי/ת רופאי/ת', 'אחזקה', 'רופא/ה - מתמחה (תקן קופה )', 'סטודנט/ית לסיעוד', 'ר. בעיסוק', 'אחראית קבלת יולדת', 'מרכזן', 'סטאגר/ת ', 'עובד מחשוב ', 'הנדסאי', 'אנסטלטור', 'אח /ות אחראי/ית', 'כח עזר'],
    "departments": ['מיון קדמי -נוף הגליל-רופאים', 'מכון הלב', 'גנאן', 'מכון מחקר', 'רפואה גרעינית - טכנאי/ת', 'גסטרו-טכנאי מכשור רפואי', 'נשים/יולדות - אח/ות', 'גריאטריה -אח/ות', 'מעבדה', 'אונקולוגיה - רופא/ה', 'מרפאת מעקב הריון- אח/ות', 'יחידת איכות ', 'חדר לידה - פקיד/ה', 'בדיקות קורונה חו``ל', 'חדר ניתוח -נקיון ', 'מרפאת מעקב הריון-רופא/ה', 'כירורגיה - רופא/ה', 'מטבח', 'דיאליזה - אח/ות', 'פזיותרפיה', 'גריאטריה ב  -אח/ות', 'הנהלת חשבונות', 'חדר לידה - כח עזר', 'דיאליזה - כח עזר', 'מונשמים -רופא/ה', 'ארכיון', 'אונקולוגיה - אח/ות', 'אורולוגיה - רופא/ה', 'קלינאי תקשורת', 'רפואה גרעינית - פקיד/ה', 'פנימית -כח עזר', 'זימון תורים', 'דיאליזה - רופא/ה', 'רפואה גרעינית - רופא/ה', 'נהג/שליח', 'משרד קבלה', 'חדר לידה - מיילדות', 'רדיולוגיה - טכנאי', 'מרפאות חוץ-אח/ות', 'גסטרו - כח עזר', 'חדר ניתוח - אספקה סטרילית', 'אורתופדיה - כח עזר', 'כירורגיה -כח עזר', 'פסיכולוגית', 'נשים/יולדות - כח עזר', 'אונקולוגיה-כח עזר', 'פקיד/ה - MRI', 'שיווק', 'בריאות האישה - טכנאי/ת', 'ללא מפעל', 'יחסי ציבור', 'מיון קדמי -נוף הגליל- פקידים', 'גסטרו - פקיד/ה', 'חדר לידה -אח/ות', 'רפואה גרעינית - פיזיקאי', 'דיאליזה - טכנאי', 'פנימית -אח/ות', 'ריפוי בעיסוק', 'מרפאת מעקב הריון - פקיד/ה', 'חדר ניתוח - רופא מרדים', 'דיטאנית', 'כביסה', 'גריאטריה -כח עזר', 'בריאות האישה - רופא/ה', 'חדר ניתוח - כח עזר', 'מחשוב', 'אורתופדיה- פקיד/ה', 'אונקולוגיה - פקיד/ה', 'מונשמים - אח/ות', 'דיאליזה PD', 'כירורגיה -אח/ות', 'יילודים - רופא/ה', 'גריאטריה ב  -כח עזר ', 'רדיולוגיה - רופא/ה', 'מרכזיה', 'משאבי אנוש', 'נשים/ילדות-טכנאית אולטרסאונד', 'בריאות הסביבה', 'רופא/ה - MRI', 'יילודים - כח עזר', 'חדר מיון - כח עזר', 'ניקיון', 'טיפול נמרץ -אח/ות', 'פנימית -פקידה', 'רישום יילודים -פקיד/ה', 'רישום רפואי', 'אורתופדיה - רופא/ה', 'הנדסה רפואית', 'דיאליזה-פקיד/ה', 'אם בית - נשים /ילדות', 'כירורגיה -פקיד/ה', 'רדיולוגיה - פקיד/ה', 'טכנאי/ת -MRI ', 'חדר ניתוח - אח/ות', 'חדר מיון - אח/ות', 'מניעת זיהומים', 'בריאות האישה - פקיד/ה', 'יילודים - אח/ות', 'חדר ניתוח -מזכירה', 'חדר מיון - רופא/ה', 'גסטרו - רופא/ה', 'מונשמים - כח עזר', 'אורתופדיה  - אח/ות', 'בית מרקחת', 'רכש ומחסן', 'נשים/יולדולת - רופא/ה', 'גסטרו - אח/ות', 'גריאטריה - רופא/ה', 'מינהל הסיעוד', 'הנהלה', 'מזכירות הנהלה ', 'נשים/יולדות-פקיד/ה', 'מכון ריאות', 'אחזקה', 'עובד/ת סוציאלית', 'טיפול נמרץ -כח עזר', 'עור ומין', 'פנימית - רופא/ה', 'מרפאות חוץ-פקיד/ה'],
    "emrgCall7714!113": "HVEWQUYECELGUWBNHRGJSX72"
}


alert_type_legend = {
    "exercise": "תרגיל",
    "real": "אירוע אמת",
    "תרגיל": "exercise",
    "אירוע אמת": "real",
}

alert_target_legend = {
    "limited": "צוות מצומצם",
    "extended": "צוות מורחב",
    "צוות מצומצם": "limited",
    "צוות מורחב": "extended",
}
